## Pandas
1. Create DataFrame
    - Copy & "="
2. rename
    - .add_prefix('_suffix_')
3. groupby
4. merge
5. join
6. Pivot table
7. string processing

## Create DataFrame

In [2]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df2 = pd.DataFrame(np.array([[1, 4], [2, 5], [3, 6]]), columns=['A','B'])
df3 = pd.DataFrame(np.array([[1, 4, 8], [1, 5, 9], [2, 6, 10], [2, 7, 11]]), columns=['A','B','D'])

In [3]:
# df 和 df1 指向同一個物件
df1 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df = df1
df['A'] = [5,5,5]
print(id(df),'\n',df)
print(id(df1),'\n',df1)

2354741246280
    A  B
0  5  4
1  5  5
2  5  6
2354741246280
    A  B
0  5  4
1  5  5
2  5  6

In [4]:
# df 指向 df1 所複製的新物件
df1 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df = df1.copy()
df['A'] = [5,5,5]
print(id(df),'\n',df)
print(id(df1),'\n',df1)

2354741239496
    A  B
0  5  4
1  5  5
2  5  6
2354706575752
    A  B
0  1  4
1  2  5
2  3  6

## rename

In [5]:
df1.rename(columns={"A": "a", "B": "c"})

   a  c
0  1  4
1  2  5
2  3  6

In [6]:
df1.columns = ['a','b']
df1

   a  b
0  1  4
1  2  5
2  3  6

In [7]:
df1.rename(str.lower, axis='columns')

   a  b
0  1  4
1  2  5
2  3  6

In [8]:
df1.rename({1: 2, 2: 4}, axis='index')

   a  b
0  1  4
2  2  5
4  3  6

In [9]:
# 添加前綴描述
df1.add_prefix('_suffix_')

   _suffix_a  _suffix_b
0          1          4
1          2          5
2          3          6

## groupby

In [10]:
print(df3)
g = df3.groupby(by=['A'],as_index=True, sort=True,group_keys=True, squeeze=False)

   A  B   D
0  1  4   8
1  1  5   9
2  2  6  10
3  2  7  11

In [11]:
# One-function:max, min, mean, count...
g.max()

   B   D
A
1  5   9
2  7  11

In [12]:
# Multi-function: groupby.agg()
g.agg({'D':['max','min','mean','count']})

    D
  max min  mean count
A
1   9   8   8.5     2
2  11  10  10.5     2

## merge
##### The function to join by key

In [13]:
print(df2)
print(df3)

   A  B
0  1  4
1  2  5
2  3  6
   A  B   D
0  1  4   8
1  1  5   9
2  2  6  10
3  2  7  11

In [14]:
df2.merge(df3,how='left', left_on='A', right_on='A',suffixes=('','_region'))

   A  B  B_region     D
0  1  4       4.0   8.0
1  1  4       5.0   9.0
2  2  5       6.0  10.0
3  2  5       7.0  11.0
4  3  6       NaN   NaN

## join
##### The function to join by index

In [15]:
print(df2)
print(df3)
df3.join(df2, how='left',rsuffix='_join')

   A  B
0  1  4
1  2  5
2  3  6
   A  B   D
0  1  4   8
1  1  5   9
2  2  6  10
3  2  7  11

   A  B   D  A_join  B_join
0  1  4   8     1.0     4.0
1  1  5   9     2.0     5.0
2  2  6  10     3.0     6.0
3  2  7  11     NaN     NaN

In [16]:
df2.join(df3, how='left',rsuffix='_join')

   A  B  A_join  B_join   D
0  1  4       1       4   8
1  2  5       1       5   9
2  3  6       2       6  10

## Pivot table

In [17]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [18]:
# pivot table by one function
table = pd.pivot_table(df, values='D', index=['A', 'B'],
                    columns=['C'], aggfunc=np.sum, fill_value=0)
table

C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

In [19]:
# pivot table by multi function
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                        aggfunc={'D': np.mean,
                                 'E': [min, max, np.mean]},
                       fill_value=0)
table

                  D   E
               mean max      mean min
A   C
bar large  5.500000   9  7.500000   6
    small  5.500000   9  8.500000   8
foo large  2.000000   5  4.500000   4
    small  2.333333   6  4.333333   2

## Str Processing : https://www.itread01.com/content/1542124444.html

In [32]:
df1 = pd.DataFrame({'Name':['Pat','Bruce'],"Dollar": ['1,000','2,000']})

In [35]:
df1.Dollar.str.slice(0,1,1)

0    1
1    2
Name: Dollar, dtype: object

In [36]:
df1.Dollar.str.replace(',','')

0    1000
1    2000
Name: Dollar, dtype: object